; domain
(define (domain barman)
  (:requirements :strips :typing)
  (:types hand level beverage dispenser container - object
  	  ingredient cocktail - beverage
          shot shaker - container)
  (:predicates  (ontable ?c - container)
                (holding ?h - hand ?c - container)
		(handempty ?h - hand)
		(empty ?c - container)
                (contains ?c - container ?b - beverage)
		(clean ?c - container)
                (used ?c - container ?b - beverage)
                (dispenses ?d - dispenser ?i - ingredient)
		(shaker-empty-level ?s - shaker ?l - level)
		(shaker-level ?s - shaker ?l - level)
		(next ?l1 ?l2 - level)
		(unshaked ?s - shaker)
		(shaked ?s - shaker)
                (cocktail-part1 ?c - cocktail ?i - ingredient)
                (cocktail-part2 ?c - cocktail ?i - ingredient))
		
  (:action grasp
             :parameters (?h - hand ?c - container)
             :precondition (and (ontable ?c) (handempty ?h))
             :effect (and (not (ontable ?c))
	     	     	  (not (handempty ?h))
			  (holding ?h ?c)))

  (:action leave
             :parameters (?h - hand ?c - container)
             :precondition (holding ?h ?c)
             :effect (and (not (holding ?h ?c))
	     	     	  (handempty ?h)
			  (ontable ?c)))
  
  (:action fill-shot
           :parameters (?s - shot ?i - ingredient ?h1 ?h2 - hand ?d - dispenser)
           :precondition (and (holding ?h1 ?s)
                              (handempty ?h2)
	   		      (dispenses ?d ?i)
                              (empty ?s)
			      (clean ?s))
           :effect (and (not (empty ?s))
	   	   	(contains ?s ?i)
	   	   	(not (clean ?s))
			(used ?s ?i)))


  (:action refill-shot
           :parameters (?s - shot ?i - ingredient ?h1 ?h2 - hand ?d - dispenser)
           :precondition (and (holding ?h1 ?s)	   		      
                              (handempty ?h2)
	   		      (dispenses ?d ?i)
                              (empty ?s)
			      (used ?s ?i))
           :effect (and (not (empty ?s))
                        (contains ?s ?i)))

  (:action empty-shot
           :parameters (?h - hand ?p - shot ?b - beverage)
           :precondition (and (holding ?h ?p)
                              (contains ?p ?b))
           :effect (and (not (contains ?p ?b))
	   	   	(empty ?p)))

  (:action clean-shot
  	   :parameters (?s - shot ?b - beverage ?h1 ?h2 - hand)
           :precondition (and (holding ?h1 ?s)
                              (handempty ?h2)	   		      
			      (empty ?s)
                              (used ?s ?b))
           :effect (and (not (used ?s ?b))
	   	   	(clean ?s)))

  (:action pour-shot-to-clean-shaker
           :parameters (?s - shot ?i - ingredient ?d - shaker ?h1 - hand ?l ?l1 - level)
           :precondition (and (holding ?h1 ?s)
			      (contains ?s ?i)
                              (empty ?d)
	   		      (clean ?d)                              
                              (shaker-level ?d ?l)
                              (next ?l ?l1))
           :effect (and (not (contains ?s ?i))
	   	   	(empty ?s)
			(contains ?d ?i)
                        (not (empty ?d))
			(not (clean ?d))
			(unshaked ?d)
			(not (shaker-level ?d ?l))
			(shaker-level ?d ?l1)))


  (:action pour-shot-to-used-shaker
           :parameters (?s - shot ?i - ingredient ?d - shaker ?h1 - hand ?l ?l1 - level)
           :precondition (and (holding ?h1 ?s)
			      (contains ?s ?i)
                              (unshaked ?d)
                              (shaker-level ?d ?l)
                              (next ?l ?l1))
           :effect (and (not (contains ?s ?i))
                        (contains ?d ?i)
	   	   	(empty ?s)     
  			(not (shaker-level ?d ?l))
			(shaker-level ?d ?l1)))

  (:action empty-shaker
           :parameters (?h - hand ?s - shaker ?b - cocktail ?l ?l1 - level)
           :precondition (and (holding ?h ?s)
                              (contains ?s ?b)
			      (shaked ?s)
			      (shaker-level ?s ?l)
			      (shaker-empty-level ?s ?l1))
           :effect (and (not (shaked ?s))
	   	   	(not (shaker-level ?s ?l))
	   	   	(shaker-level ?s ?l1)
			(not (contains ?s ?b))
	   	   	(empty ?s)))

  (:action clean-shaker
  	   :parameters (?h1 ?h2 - hand ?s - shaker)
           :precondition (and (holding ?h1 ?s)
                              (handempty ?h2)
                              (empty ?s))
           :effect (and (clean ?s)))
  
  (:action shake
  	   :parameters (?b - cocktail ?d1 ?d2 - ingredient ?s - shaker ?h1 ?h2 - hand)
           :precondition (and (holding ?h1 ?s)
                              (handempty ?h2)
			      (contains ?s ?d1)
                              (contains ?s ?d2)
                              (cocktail-part1 ?b ?d1)
			      (cocktail-part2 ?b ?d2)
			      (unshaked ?s))			      
           :effect (and (not (unshaked ?s))
		        (not (contains ?s ?d1))
                        (not (contains ?s ?d2))
	   	   	(shaked ?s)
                        (contains ?s ?b)))

  (:action pour-shaker-to-shot
           :parameters (?b - beverage ?d - shot ?h - hand ?s - shaker ?l ?l1 - level)
           :precondition (and (holding ?h ?s)
			      (shaked ?s)
			      (empty ?d)
			      (clean ?d)
			      (contains ?s ?b)
                              (shaker-level ?s ?l)
                              (next ?l1 ?l))
           :effect (and (not (clean ?d))
	   	   	(not (empty ?d))
			(contains ?d ?b)
			(shaker-level ?s ?l1)
			(not (shaker-level ?s ?l))))
 )

; problem
(define (problem prob)
 (:domain barman)
 (:objects 
      shaker1 - shaker
      left right - hand
      shot1 shot2 shot3 shot4 shot5 shot6 - shot
      ingredient1 ingredient2 ingredient3 ingredient4 - ingredient
      cocktail1 - cocktail
      dispenser1 dispenser2 dispenser3 dispenser4 - dispenser
      l0 l1 l2 - level
)
 (:init 
  (ontable shaker1)
  (ontable shot1)
  (ontable shot2)
  (ontable shot3)
  (ontable shot4)
  (ontable shot5)
  (ontable shot6)
  (dispenses dispenser1 ingredient1)
  (dispenses dispenser2 ingredient2)
  (dispenses dispenser3 ingredient3)
  (dispenses dispenser4 ingredient4)
  (clean shaker1)
  (clean shot1)
  (clean shot2)
  (clean shot3)
  (clean shot4)
  (clean shot5)
  (clean shot6)
  (empty shaker1)
  (empty shot1)
  (empty shot2)
  (empty shot3)
  (empty shot4)
  (empty shot5)
  (empty shot6)
  (handempty left)
  (handempty right)
  (shaker-empty-level shaker1 l0)
  (shaker-level shaker1 l0)
  (next l0 l1)
  (next l1 l2)
  (cocktail-part1 cocktail1 ingredient2)
  (cocktail-part2 cocktail1 ingredient3)
)
 (:goal
  (and
      (contains shot1 cocktail1)
      (contains shot2 cocktail1)
      (contains shot3 ingredient4)
      (contains shot4 cocktail1)
      (contains shot5 cocktail1)
)))

; plan
1. (grasp left shot3)
   deleted: (ontable shot3) (handempty left)
   added: (holding left shot3)
   goals met: 0 of 5
2. (fill-shot shot3 ingredient3 left right dispenser3)
   deleted: (empty shot3) (clean shot3)
   added: (contains shot3 ingredient3) (used shot3 ingredient3)
   goals met: 0 of 5
3. (pour-shot-to-clean-shaker shot3 ingredient3 shaker1 left l0 l1)
   deleted: (contains shot3 ingredient3) (empty shaker1) (clean shaker1) (shaker-level shaker1 l0)
   added: (empty shot3) (contains shaker1 ingredient3) (unshaked shaker1) (shaker-level shaker1 l1)
   goals met: 0 of 5
4. (clean-shot shot3 ingredient3 left right)
   deleted: (used shot3 ingredient3)
   added: (clean shot3)
   goals met: 0 of 5
5. (fill-shot shot3 ingredient2 left right dispenser2)
   deleted: (empty shot3) (clean shot3)
   added: (contains shot3 ingredient2) (used shot3 ingredient2)
   goals met: 0 of 5
6. (pour-shot-to-used-shaker shot3 ingredient2 shaker1 left l1 l2)
   deleted: (contains shot3 ingredient2) (shaker-level shaker1 l1)
   added: (contains shaker1 ingredient2) (empty shot3) (shaker-level shaker1 l2)
   goals met: 0 of 5
7. (clean-shot shot3 ingredient2 left right)
   deleted: (used shot3 ingredient2)
   added: (clean shot3)
   goals met: 0 of 5
8. (fill-shot shot3 ingredient4 left right dispenser4)
   deleted: (empty shot3) (clean shot3)
   added: (contains shot3 ingredient4) (used shot3 ingredient4)
   goals met: 1 of 5
9. (leave left shot3)
   deleted: (holding left shot3)
   added: (handempty left) (ontable shot3)
   goals met: 1 of 5
10. (grasp left shaker1)
   deleted: (ontable shaker1) (handempty left)
   added: (holding left shaker1)
   goals met: 1 of 5
11. (shake cocktail1 ingredient2 ingredient3 shaker1 left right)
   deleted: (unshaked shaker1) (contains shaker1 ingredient2) (contains shaker1 ingredient3)
   added: (shaked shaker1) (contains shaker1 cocktail1)
   goals met: 1 of 5
12. (pour-shaker-to-shot cocktail1 shot2 left shaker1 l2 l1)
   deleted: (clean shot2) (empty shot2) (shaker-level shaker1 l2)
   added: (contains shot2 cocktail1) (shaker-level shaker1 l1)
   goals met: 2 of 5
13. (pour-shaker-to-shot cocktail1 shot1 left shaker1 l1 l0)
   deleted: (clean shot1) (empty shot1) (shaker-level shaker1 l1)
   added: (contains shot1 cocktail1) (shaker-level shaker1 l0)
   goals met: 3 of 5
14. (empty-shaker left shaker1 cocktail1 l0 l0)
   deleted: (shaked shaker1) (contains shaker1 cocktail1)
   added: (empty shaker1)
   goals met: 3 of 5
15. (clean-shaker left right shaker1)
   added: (clean shaker1)
   goals met: 3 of 5
16. (leave left shaker1)
   deleted: (holding left shaker1)
   added: (handempty left) (ontable shaker1)
   goals met: 3 of 5
17. (grasp left shot6)
   deleted: (ontable shot6) (handempty left)
   added: (holding left shot6)
   goals met: 3 of 5
18. (fill-shot shot6 ingredient2 left right dispenser2)
   deleted: (empty shot6) (clean shot6)
   added: (contains shot6 ingredient2) (used shot6 ingredient2)
   goals met: 3 of 5
19. (pour-shot-to-clean-shaker shot6 ingredient2 shaker1 left l0 l1)
   deleted: (contains shot6 ingredient2) (empty shaker1) (clean shaker1) (shaker-level shaker1 l0)
   added: (empty shot6) (contains shaker1 ingredient2) (unshaked shaker1) (shaker-level shaker1 l1)
   goals met: 3 of 5
20. (clean-shot shot6 ingredient2 left right)
   deleted: (used shot6 ingredient2)
   added: (clean shot6)
   goals met: 3 of 5
21. (fill-shot shot6 ingredient3 left right dispenser3)
   deleted: (empty shot6) (clean shot6)
   added: (contains shot6 ingredient3) (used shot6 ingredient3)
   goals met: 3 of 5
22. (grasp right shaker1)
   deleted: (ontable shaker1) (handempty right)
   added: (holding right shaker1)
   goals met: 3 of 5
23. (pour-shot-to-used-shaker shot6 ingredient3 shaker1 left l1 l2)
   deleted: (contains shot6 ingredient3) (shaker-level shaker1 l1)
   added: (contains shaker1 ingredient3) (empty shot6) (shaker-level shaker1 l2)
   goals met: 3 of 5
24. (leave left shot6)
   deleted: (holding left shot6)
   added: (handempty left) (ontable shot6)
   goals met: 3 of 5
25. (shake cocktail1 ingredient2 ingredient3 shaker1 right left)
   deleted: (unshaked shaker1) (contains shaker1 ingredient2) (contains shaker1 ingredient3)
   added: (shaked shaker1) (contains shaker1 cocktail1)
   goals met: 3 of 5
26. (pour-shaker-to-shot cocktail1 shot4 right shaker1 l2 l1)
   deleted: (clean shot4) (empty shot4) (shaker-level shaker1 l2)
   added: (contains shot4 cocktail1) (shaker-level shaker1 l1)
   goals met: 4 of 5
27. (pour-shaker-to-shot cocktail1 shot5 right shaker1 l1 l0)
   deleted: (clean shot5) (empty shot5) (shaker-level shaker1 l1)
   added: (contains shot5 cocktail1) (shaker-level shaker1 l0)
   goals met: 5 of 5
